{
 "titulo": "Revista de Partes de Computadoras",
 "articulos": [
 {
 "titulo": "Procesadores",
 "imagen": "imagenes/procesador.jpg",
 "contenido": "Los procesadores son componentes fundamentales en una computadora.Son responsables de realizar las operaciones y cálculos necesarios para el funcionamiento del sistema. Estos chips de silicio contienen millones de transistores y pueden ejecutar instrucciones en nanosegundos. Los procesadores actuales ofrecen un rendimiento excepcional y están diseñados para manejar tareas complejas como juegos, edición de video y renderizado 3D. Con el avance de la tecnología, los procesadores cada vez son más rápidos y eficientes, lo que permite realizar tareas más exigentes y mejorar la experiencia del usuario."
 },
 {
 "titulo": "Tarjetas gráficas",
 "imagen": "imagenes/tarjeta-madre.jpg",
 "contenido": "Las tarjetas gráficas son componentes esenciales para los amantes de los juegos y el diseño gráfico. Estas unidades de procesamiento gráfico (GPU) están diseñadas específicamente para manejar tareas intensivas en gráficos, como renderizado en 3D, efectos visuales y cálculos matemáticos complejos. Las tarjetas gráficas modernas ofrecen un rendimiento excepcional y son capaces de mostrar gráficos de alta calidad y realismo en tiempo real. Además, las últimas tarjetas gráficas cuentan con tecnologías avanzadas como trazado de rayos y inteligencia artificial, lo que permite obtener imágenes más detalladas y efectos visuales impresionantes."
 },
 {
 "titulo": "Memoria RAM",
 "imagen": "imagenes/memoria-ram.jpg",
 "contenido": "La memoria RAM (Random Access Memory) es un componente vital en cualquier computadora. Actúa como espacio de almacenamiento temporal para los datos y programas que se están utilizando en el momento. Cuanta más memoria RAM tenga un equipo, más rápido y eficiente será. La memoria RAM permite acceder rápidamente a los datos, lo que acelera el rendimiento general del sistema. En la actualidad, existen diferentes tipos de RAM, como DDR3, DDR4 y DDR5, cada una con diferentes velocidades y capacidades. Los usuarios que realizan tareas exigentes, como edición de video o juegos, suelen requerir una mayor cantidad de memoria RAM para garantizar un funcionamiento fluido y sin interrupciones."
 },
 {
 "titulo": "Disco duro",
 "imagen": "imagenes/disco-duro.jpg",
 "contenido": "El disco duro es el dispositivo de almacenamiento principal de la computadora, donde se guardan los archivos y programas."
 }
 ]
}
